{"0":{"id":"9c26adce57e692c7cf837a78d7f210fb","published":"2024-04-21 09:05:35","title":"BlackRock Bitcoin ETF hits 69 days of inflows on '4\/20' halving day","summary":"['Bitcoin sees some curious meme-related coincidences this halving thanks to ETF performance.']","label":"Bitcoin"},"1":{"id":"abac682992fb9e047e2e9ad4d5faf977","published":"2024-04-20 12:30:46","title":"Binance tax evasion trial moved to May 17 in Nigeria","summary":"['Nigerian court adjourns Binance tax evasion trial to May 17 due to lack of formal charges served. Gambaryan, Binance’s exec, cannot plead until served. Anjarwalla absent. Trial on laundering $35M resumes May 2. Gambaryan sues govt over rights violation.']","label":"Other"},"2":{"id":"17ccb79f63ff7fdf3d0e2eaecb4cf635","published":"2024-04-20 09:25:15","title":"USA to forge AI partnership with Nigeria for economic growth","summary":"['The USA and Nigeria plan to discuss the digital economy and AI partnerships. U.S. officials will meet in Abuja and aim for a Lagos AI conference. More robust economic ties are envisioned, and AI governance is stressed.']","label":"AI"},"3":{"id":"a5aa5d071993b6ed074b8e3cec08d810","published":"2024-04-20 07:22:35","title":"Nigeria launches first multilingual large language model in Africa","summary":"['Nigeria launches its first Multilingual large language model (LLM) in AI, aiming for African leadership. The initiative, follows a four-day AI workshop. Funding totaling $3.5 million, including $1.5 million in direct funds, supports the initiative.']","label":"AI"},"4":{"id":"ecdd779969ef3ae7ae7634f333b50494","published":"2024-04-20 00:09:53","title":"Bitcoin halving 2024 — Done and dusted!","summary":"['Bitcoin has completed its fourth halving event upon reaching its 840,000th block, a milestone occurring roughly every four years.']","label":"Bitcoin"},"5":{"id":"fffbd63db308ab3f6f76e7c9ba1a2c24","published":"2024-04-19 22:54:22","title":"Here’s where you can catch the Bitcoin halving live","summary":"[\"Bitcoiners are set to gather worldwide to celebrate Bitcoin's fourth-ever halving event. Here's where you can join them.\"]","label":"Bitcoin"},"6":{"id":"c258dc56d9c073f3bd217fdda260584c","published":"2024-04-19 20:55:00","title":"Bitcoin halving 2024: How to keep BTC mining efficient as rewards decrease","summary":"['As the Bitcoin halving heats up competition for miners, turnkey solutions help by simplifying operations while maintaining efficiency']","label":"Bitcoin"},"7":{"id":"f6e56a793bad92b12f307a1562d4c4e3","published":"2024-04-19 20:12:05","title":"Here’s what happened in crypto today","summary":"['A lot happened in crypto today! Cointelegraph explores the latest events impacting the Bitcoin price, altcoins, DeFi, Web3, NFTs and more.']","label":"Bitcoin"},"8":{"id":"a5ffe508d4883df3573572fa2458d20b","published":"2024-04-19 18:16:30","title":"New Telegram mini-apps will be so convenient users won’t know it’s crypto","summary":"['TON Foundation director of investments Justin Hyun talked about the new features coming to Telegram after the launch of the Tether stablecoin on the TON blockchain.']","label":"Other"},"9":{"id":"c06b4c6ebd19a733df48c33f9bab5d86","published":"2024-04-19 11:20:00","title":"5 things you didn't know about Bitcoin halvings and BTC price","summary":"[\"As the market approaches Bitcoin's fourth halving on April 19, let's explore five intriguing facts about this phenomenon that may surprise even the most seasoned crypto-enthusiasts.\"]","label":"Bitcoin"},"10":{"id":"2b402e9233cbaf048f771c590d1fe1d0","published":"2024-04-19 11:18:47","title":"Tether USDT stablecoin to launch on TON blockchain","summary":"['Tether is launching the U.S. dollar-pegged USDT stablecoin and the gold-pegged XAUT stablecoin on The Open Network.']","label":"Other"},"11":{"id":"6f559cba8980c1c1139121a83d714ed3","published":"2024-04-19 08:36:26","title":"BTC price hits $65K as rumor Middle East tensions over boosts Bitcoin","summary":"['Bitcoin deals a round of liquidations to shorts as BTC price action stays closely tied to geopolitics.']","label":"Bitcoin"},"12":{"id":"cbc621ee7d2ee724988c256dd68a01f4","published":"2024-04-19 07:37:01","title":"Binance exec remains in jail as bail appeal fails again","summary":"['Binance executive Tigran Gambaryan’s bail application hearing has been postponed to April 22, as he remains in Kuje correctional center custody. The EFCC cites new defense points for the delay.']","label":"Other"},"13":{"id":"93f7f3bea229d3201e1c747be8e49f76","published":"2024-04-19 06:22:41","title":"Mark Zuckerberg says Meta wearables that read brain signals are coming soon","summary":"['Social media giant Meta is getting closer to releasing a consumer neural interface that uses brainwaves to control devices.']","label":"Other"},"14":{"id":"676d65afdee9dd485891de51306593d9","published":"2024-04-19 03:07:59","title":"Bitcoin briefly dips under $60K amid reports of worsening Middle East crisis","summary":"['Bitcoin fell below its critical $60,000 support level for a brief moment on Thursday amid reports of escalating conflict in the Middle East.']","label":"Bitcoin"},"15":{"id":"1ec7ffd129375f94e767601a035eafe8","published":"2024-04-19 02:12:34","title":"Bitcoin hodlers moved $1.7B into ‘accumulation’ wallets during the BTC dip","summary":"['Long-term Bitcoin holders moved a record $1.7 billion worth of BTC to long-term holding addresses in a single 24-hour period when the price of Bitcoin fell below $63,000 on April 16.']","label":"Bitcoin"},"16":{"id":"8ce976855f1bba944c283f1577539a5e","published":"2024-04-19 00:35:06","title":"Bitcoin fees top Ethereum for 3 days in a row as halving approaches","summary":"['Bitcoin miners have raked in more fees than Ethereum stakers in the last three days as the industry awaits for the fourth halving event and the introduction of a new token standard on Bitcoin.']","label":"Bitcoin"},"17":{"id":"f9b3fb5fe32bb5af15ad6f10f1dfa895","published":"2024-04-18 21:29:00","title":"The Runes protocol will ignite a new season for Bitcoin after the halving","summary":"[\"The Runes protocol will launch when Bitcoin's halving takes place, and a wave of new tokens will ignite a new season for the world's largest blockchain.\"]","label":"Bitcoin"},"18":{"id":"f35b32aeeeca4f0a05b8e966728ee558","published":"2024-04-18 19:45:00","title":"Meta launches ‘most capable openly available LLM to date,’ rivaling GPT and Claude","summary":"['Meta launches Llama-3 and a new Meta AI portal, claiming its new model is the most capable open-source market to date.']","label":"Other"},"19":{"id":"5a21ddf46fc5bc951e8117fdcc7e7423","published":"2024-04-18 17:27:50","title":"Mango Markets exploiter found guilty after jury deliberations","summary":"['After less than a day of deliberations, a Manhattan jury found Avraham Eisenberg guilty of fraud and market manipulation.']","label":"Other"},"20":{"id":"9668694b39120aded8cfec4fa7f5b4ef","published":"2024-04-18 16:55:54","title":"BTC price bounces at support that fueled 2023 bull market","summary":"['Bitcoin sees support from a familiar trendline during the latest BTC price relief bounce.']","label":"Bitcoin"},"21":{"id":"44d730caa5bf336bd02a3cb457075452","published":"2024-04-18 13:00:00","title":"Welcome to the future where on-chain robots serve coffee and crypto rewards","summary":"['Forget baristas, the future of coffee is automated and powered by blockchain. A robotic cafe lets users earn crypto for every cup purchased, ushering in a new era of Web3 machine ownership via DePINS.']","label":"Other"},"22":{"id":"d66541c54344af668524997d3b04db3d","published":"2024-04-18 12:37:29","title":"Have altcoins hit the bottom? Bitcoin price bounces 5% from $59.7K low","summary":"['Bitcoin may stay \"boring\" while altcoins recover after the halving, analysis claims as crypto traders flip modestly optimistic.']","label":"Bitcoin"},"23":{"id":"747d3fa608d2b6a4b0d2a25271f45040","published":"2024-04-18 09:31:58","title":"Tokenized asset market could hit $16T on public blockchains — RippleX VP","summary":"['Institutional investors, asset managers and banks are racing to bring financial assets on-chain in a market that is estimated to grow to $16 trillion in value.']","label":"Other"},"24":{"id":"f658031e851847c83078d259d7863a37","published":"2024-04-18 02:40:54","title":"Gary Gensler’s resignation ‘troll’ post disappoints Crypto X","summary":"['SEC Chair Gary Gensler isn’t quitting the SEC, but his X posts initially tricked many into believing he was.']","label":"Other"}}